module.exports = {
    home: {
        buy: 'Начать сделку🛒',
        faq: 'Поддержка ⚙',
        vacancy: 'О нас 💼',
        delivery: 'Гарантии 🔐'
    },

    order: {
        tobuyrub: 'Вы продаете 📤',
        tobuyuah: 'Вы покупаете 📥',
    },
    howmuchrub: {
        tenr: 'Информация 📧',
        twentyr: 'Физические вещи (реальные) 📦',
    },


        choosecity1: 'Я указал товар 🖋',
        choosecity2: 'Я указал товар 🖊',

        deliverytype2: {
        email: 'Электронная почта 📩',
        teleg: 'Telegram 📃',
        anymes: 'Другой мессенджер (по договоренности) ✏'
    },
        deliverytype1: {
            klad: 'Заклад 🌱',
            post: 'Почтой России 📩',
            kurier: 'Курьерская доставка 🚚'
        },
        whois: 'Я указал ссылку 📎',

        donet: 'Начать сделку 🔑',
        back: 'На главную 🔙'
    }
